<!-- html -->
<template>
  <div class="modalBox">
    <div class="cancel_view">
        <img src="../../assets/cancel.png" class="cancel_img" @click='cancelAction'>
    </div>
    <div class="content">
      <!-- cancel -->
      <!-- logo -->
      <div class="logo_view">
        <img src="../../assets/plogo.png" class="logo_img">
      </div>
      <!-- title -->
      <div class="title_line"></div>
      <div class="title"> <strong>{{title}}</strong> </div>
      <!-- text htnl -->
      <div class="html_view">
        <div style="color:black">关于philosophy肌肤哲理及本隐私声明</div>
        <p>感谢您访问philosophy肌肤哲理官方网站（以下简称“本网站”）。</p>
        本网站由科蒂商贸（上海）有限公司下属philosophy肌肤哲理品牌（以下称“philosophy肌肤哲理”）及其授权代理人运行维护。本网站向公众开放，向关注philosophy肌肤哲理的人士提供philosophy肌肤哲理的最新消息、产品、技术及服务的相关信息。 在使用本网站前，敬请您仔细阅读以下各项使用条款（以下简称“本使用条款”）。您对本网站的使用(包括但不限于对本网站的访问、登录，对本网站内容的浏览和使用)，将被视为您自愿承诺接受本声明的约束，包括但不限于知识产权声明、个人信息保护等。如果您对本使用条款的内容不能接受，您应当立即停止使用本网站并迅速离开。
        <p>本网站的使用：</p>
        philosophy肌肤哲理有限许可您在您的计算机设备上浏览（使用）本网站展示的内容（详见以下知识产权声明）。在您遵守本使用条款的前提下，您可以有限使用本网站的相关内容，但仅允许作为您私人的非商业目的之使用。
        <br>上段所述有限授权不含下列权利：(i) 利用框架或处理技术纳入本网站或其任何部分；(ii) 修改或下载本网站或网站内容(高速缓存或为浏览本网站所必要者，不在此限)；(iii) 将本网站或网站内容用于非个人使用；(iv) 基于本网站或网站内容创作衍生物；(v) 为您个人或其他人之利益而收集帐户资讯；(vi) 利用基本定义标签或其他使用本公司名称或商标之「隐藏文字」或以其他方式使用商标；(vi) 使用类似资料收集及提取工具或软体，或以其他任何行为，对我公司基础设施加诸不合理之负担或负载。
        <p>philosophy肌肤哲理的商品信息：</p>
        本网站将尽力提供商品及服务的准确描述，但不保证philosophy肌肤哲理网站上之商品说明、颜色、尺寸、价格或其他描述完全正确、完整、即时、无错误和可靠。
        <p>philosophy肌肤哲理的网站交易：</p>
        本网站目前不提供任何网上交易服务。如果您对本网站展示的philosophy肌肤哲理商品有购买意向，欢迎您进入我们的肌肤哲理天猫官方旗舰店https://philosophy.tmall.com进行选购。
        <p>知识产权声明：</p>
        本网站，包括(但不仅限于) 文字，内容，软件，录像，音乐，声音，图形，照片，图表，美术设计，图片，名称，标识，商标和/或服务标志（包括已注册和未注册的），以及其他资料（以下简称“网站内容”）都受到著作权法，商标法、专利法以及其他知识产权相关法律和公约的保护。本网站内容包括philosophy肌肤哲理所有或控制下的内容和第三方所有或控制下，并授权philosophy肌肤哲理使用的内容。所有个人文章、报道等一切构成本网站的元素都可能是受著作权法保护的作品。您同意遵守所有适用本网站的著作权保护法律法规，以及所有本网站包含的补充性的著作权说明或限制。
        “philosophy肌肤哲理”以及本网站所有标注有“®”或“TM”的品牌或标志，均为科蒂商贸（上海）有限公司（或philosophy肌肤哲理其他关联公司，或经philosophy肌肤哲理许可使用的产品供应商）的注册商标。在未经philosophy肌肤哲理（或相关权利人）授权同意前，您无权使用上述的商标和名称，且不享有任何权利和利益。 本网站的任何内容都不应被视为授予任何人使用本网站所显示的商标及其他知识产权的许可或权力。除非在本使用条款的适用范围内，一切对本网站商标或其他内容的使用（或误用）都将被严格禁止。在法律许可的最大范围内，philosophy肌肤哲理将积极采取一切措施保护其知识产权，包括诉诸刑事司法救济。
        <p>个人信息的保护：</p>
        philosophy肌肤哲理尊重访问本网站的任何个人的隐私信息。当您访问本网站的时候可能被要求提供您个人的基本资料(如姓名、电子邮件、电话号码等)，您可以自行选择是否提供。对于您提供的个人信息，philosophy肌肤哲理将根据中华人民共和国相关法律进行保密并严格保管，不会将这些信息以任何方式提供或展示给任何第三方，但下述情况除外：
        <br>(一)  当司法机关或行政机关依照法定程序和法定职权要求本网站披露个人资料时，我们将依法提供相关资料。对于此情况下的任何披露，本网站均得免责；
        <br>(二)  对于任何由黑客攻击、计算机病毒侵入或发作、或政府管制而造成的暂时性关闭等影响网站正常运营的不可抗力事件所造成的个人资料的泄露、丢失、被盗用或被篡改等，本网站均得免责；
        <br>(三)  对于用户将个人密码告知他人或与他人共享注册帐号所导致的任何个人资料泄露，丢失、被盗用或被篡改等,本网站不负任何责任；
        <br>(四)  对于与本网站链接的任何其它网站的个人资料泄露，丢失、被盗用或被篡改等事件，本网站不负任何责任。
        <p>本网站内容的禁止使用：</p>
        除非本使用条款列明的情况、或得到philosophy肌肤哲理的书面许可，任何个人不得将本网站任何内容拷贝、复制，重组、重新编译、翻译、解码、分解、反向工程、分发、出版、展示、运行，修改、上载并以此为范本创作、转载以及任何其他方式使用于任何其他网站。
        <p>对本网站的内容提交：</p>
        本网站恕不接受自发性建议及构想；但若经由本网站提出之自发性建议及构想、任何疑问、回馈、建议、构想评论、意见及其他内容、资讯或资料(以下统称“提交内容”)，本公司政策如下：
        <br>o 提交内容不具机密性及专有性 (例如因受雇关系或依保密合约而知悉或揭露之内部资讯、专有、机密资讯)；
        <br>o 不违反或侵害第三方之专利权、商标权、营业秘密、著作权或其他专有或隐私权，且无非法、猥亵、威胁、诽谤、令人反感或以其他方式伤害任何第三方；
        <br>o 不含软体病毒或恶意软体；
        <br>o 不含政治活动、连锁信、群发邮件或任何形式之垃圾信件；
        <br>o 不含广告或任何种类的招揽或其他商业内容；
        <br>o 非用以假扮任何个人或组织，亦非使用不实之电子邮件信箱、假扮任何个人或组织，或以其他方式误导其来源；
        <br>o 不含philosophy肌肤哲理发言人以外人士意图代表philosophy肌肤哲理发言之讯息，或意图发表本公司机密资讯或关于philosophy肌肤哲理的意见；
        <br>o 不得提供未经授权而下载受著作权保护、机密或隐私的资讯；
        <br>o 不含个人资讯 (例如电话号码、身份证号、付款卡帐号、地址)，但philosophy肌肤哲理明确要求您提供前述资讯者，不在此限。
        <p>philosophy肌肤哲理无义务但保留权利得自行决定是否监督、移除或编辑提交内容。</p>
        您特此授权philosophy肌肤哲理、其母公司及关系企业，对您传送或刊登的提交内容，享有全球非专属、无偿、永久、可转让、不可撤回、可完全再授权之权利，得以任何形式、媒介或技术使用提交内容，不论现有已知或其后所开发，单独或与其他著作合并，或将提交内容重制、修改、改写、公开发表、出售、转让、翻译、制作衍生著作、散布、展示。您亦了解，提交内容可能无法返还，我们可基于任何目的使用您的提交内容，或内含之构想、概念或关键知识，包括但不限于用于开发、制造、经销及行销商品。
        <br>一旦提交内容，即表示声明保证您拥有提交内容之所有权或其他控制权；您进一步声明保证，此项提交并不构成或包含软体病毒、商业招标、连锁信、群发邮件或任何形式之垃圾信件。您不得使用不实电子邮件信箱、假扮任何个人或组织，或以其他方式误导我方关于提交内容之来源。于相关法律允许之最大范围内，若因提交内容之一切权利而产生权利主张，导致 philosophy肌肤哲理、其母公司及关系企业遭求偿，您同意对本公司负赔偿责任。
        <p>特别条款：</p>
        本条所规定的内容仅适用于本网站。为方便您使用，本网站可能提供了部分第三方网站内容的链接（以下简称“第三方内容”）。但上述第三方内容未经philosophy肌肤哲理审核，仅供您参考。除非经philosophy肌肤哲理的明确声明，philosophy肌肤哲理不认可或采纳任何第三方内容，且philosophy肌肤哲理不保证或担保任何第三方内容的准确性、完整性、时效性及真实性。您应自行承担您因使用上述链接及第三方内容而可能遭受的全部风险。此外，任何第三方内容上有关产品、服务、技术方法、或关于商号、商标、制造商、供应商等的信息都不可认为是已经过philosophy肌肤哲理认可的、赞助的或推荐的。 您可能在本网站的个别网页上看到某些附加条款。您对上述个别网页的使用即表明您同意遵守上述个别网页上的附加条款。如果上述个别网页上的附加条款和本使用条款有冲突，则个别网页上的附加条款应优先适用。
        <p>网站的更新与变更：</p>
        philosophy肌肤哲理提供的本网站上的内容仅为方便您获取信息，philosophy肌肤哲理有权单方面在任何时间，对本网站的内容进行变更或更新，此种变更或更新无需以通知您或任何第三方为前提，变更或更新自公布之日起立即生效。在上述变更或更新生效后，若您继续使用philosophy肌肤哲理网站，即构成您承认并接受上述变更或更新。我们建议您定期访问本网站以尽快获知有关的更新或变更的信息。
        <br>philosophy肌肤哲理网站上的部分功能或服务，可能使用philosophy肌肤哲理不定期公告之其他条款和规定。所有其他条款和规定应视为本使用条款的一部分。
        <p>无担保声明：</p>
        <br>在法律允许的最大限度内，本网站及本网站的内容不包括任何明确或暗示的有关（但不限于）所有权，适销性，质量满意程度，特定用途的适用性，产品参数的准确性、时效性和完整性，不侵犯知识产权和其它方权利的承诺。
        <br>philosophy肌肤哲理尽其合理的商业努力维护本网站的安全和功能，但不保证本网站上的所有功能正常运作，也不保证本网站连续性地或无故障运行或缺陷被及时更正。
        <br>philosophy肌肤哲理不保证本网站系统适合您的电脑操作系统性能，也不保证本网站或其服务器永不产生故障或没有病毒、木马程序和其他有害程序。philosophy肌肤哲理亦不承担您因上述问题而产生的任何电脑的损坏的责任。
        <br>philosophy肌肤哲理不为您所使用的访问本网站的网络线路和设备的可靠性以及连续性承担责任。
        <p>禁止盗链：</p>
        philosophy肌肤哲理禁止未经授权的指向本网站的超文本链接，以及擅自利用本网站内容的网页构架系统的行为。philosophy肌肤哲理保留断开任何未经授权指向本网站的超文本链接或网页构架系统的权利。
        <p>终止使用：</p>
        若philosophy肌肤哲理自行判断认为您已违反了本使用条款，philosophy肌肤哲理有权自行决定并无需事先通知，立即终止您对本网站的使用，或者采取措施禁止您对本网站的再次访问。
        <br>若您违反本使用条款致使philosophy肌肤哲理对您提起法律诉讼，在不影响法律授予philosophy肌肤哲理的其他救济手段外，philosophy肌肤哲理有权要求您承担所有赔偿责任以及合理的律师费及诉讼费。您进一步同意，因对本使用条款的任何违反而导致philosophy肌肤哲理终止您使用本网站的权限，philosophy肌肤哲理不对您承担任何责任。
        philosophy肌肤哲理保留权利，可随时决定，暂时或永久修改或停止本网站，且无需向您或第三方承担任何赔偿责任。
        <p>准据法和管辖权:</p>
        <br>本网站内容及本使用条款的解释和适用均适用中华人民共和国法律，由于使用本网站而产生的一切纠纷，除另有约定，均由上海国际仲裁中心通过仲裁解决。
        <p>继续有效原则:</p>
        如果本使用条款中的部分条款被有关机关认定为无效，则此无效部分并不影响本使用条款其他部分的效力，其他部分仍然有效。
        <p><strong>关于 philosophy肌肤哲理及本隐私声明：</strong></p>
        科蒂商贸（上海）有限公司下属 philosophy肌肤哲理品牌，注册办公室位于上海市黄浦区福州路666号8楼C座。 在本隐私声明中，“ philosophy肌肤哲理”（及“我们”和“我们的”）一词指的是在上述注册地址的 philosophy肌肤哲理总部及我们的专卖店和网上商城。
        <br>以下政策解释了当您参观 philosophy肌肤哲理专卖店或致电 philosophy肌肤哲理客户服务人员时，我们是如何收集、使用、披露和转让您在我们网站或移动应用程序（统称“平台”）中所提供的个人信息的，因此请您仔细审阅。该等政策也解释了当您使用我们的平台时，我们是如何通过使用cookies和相关技术收集信息的。
        <br>获取更多有关 philosophy肌肤哲理和使用我们平台的“使用条款”的信息，请访问网站使用条款。
        <br>本隐私声明最新更新于2017年7月，可能不定时变更，敬请定期查看以获取最新信息。
        <br>您提供给我们的信息以及我们如何使用该等信息
        <br>如果您要访问我们的平台，可能会需要进行注册（但当您仅浏览网站时，我们不会主动要求您输入个人信息）。若需要，在注册过程中，您将会被要求提交相关个人信息（包括姓名、出生日期、邮箱地址、电话号码等）。在相关信息组里录入您的详细信息，即授权 philosophy肌肤哲理向您提供所选择的服务。
        <br>此外，当您与我们通信时（例如，向我们发送电子邮件或邮寄信函时），当您在访问 philosophy肌肤哲理专卖店或致电 philosophy肌肤哲理客户服务人员而向我们提供详细信息时，我们可能收集个人信息。敬请注意，致电 philosophy肌肤哲理客户服务人员的电话可能基于安全、培训或发展之目的而被予以记录。
        <br>根据下文“我们自动收集的Cookies及其他信息”部分的描述，我们也会自动收集访问我们平台的访问者相关信息。
        <br>一经您的同意（包括但不限于签署相关文件、访问平台、点击相关确认键以及其他可以被合理理解为您已经表示同意的方式均被视为您已作出了该等“同意”），我们将基于以下目的收集和使用您的信息：
        <br>·管理和完成采购和修理订单及提供售后服务；
        <br>·处理您的查询和要求；
        <br>·发送与服务相关的通信，包括注意事项和行政管理信息，比如订单确认；
        <br>·根据您的通信喜好向您通知我们的新产品和活动（获取您可以如何管控更新信息的更多内容，请参阅下文“编辑或删除您的个人信息”部分）；
        <br>·进行市场调研，以不断优化提供给客户的服务；
        <br>·防止欺诈和其他禁止或非法活动；及了解我们平台的使用情况，以不断改进我们的平台和产品服务；
        <br>·遵守法律、法规、行业标准以及我们的政策。
        <br>您的个人资料将可能用于以下几种情况: (1)帮助我们更了解您的个人需求；（2）帮助我们更好地经营网站；（3）帮助我们提供更优质的顾客服务。
        <p>我们自动收集的COOKIES和其他信息</p>
        与大多数网站一样， philosophy肌肤哲理记录IP地址，并使用cookies和其他类似技术来识别顾客和定制顾客体验，并获得访问者是如何访问我们平台的信息。获取更多信息，请审阅下文我们是如何使用cookies和相关技术的内容。
        <p>什么是cookie？</p>
        Cookies是一种存储少量信息的文本文件，当您访问某网站或移动应用程序时，该等信息将被下载到您的电脑或移动设备中，用于您再次访问该网站或移动应用程序时识别您的电脑。为使平台运作、或更有效地运作，同时向平台所有者提供信息，cookies被广泛予以运用。
        <br>我们使用cookies以加强访问者的在线体验（例如，记录您的语言喜好），并使我们更好地理解自身平台是如何使用的。Cookies可能会告诉我们一些信息，比如，您之前是否访问过我们的平台或您是否是一位新的访问者。这些信息可以帮助我们确保您在线看到与您和您的喜好更相关的广告。
        <br>Cookies包含两大类：
        <br>·第一方cookies，直接由 philosophy肌肤哲理发送至您的电脑或移动设备。该等cookies只供 philosophy肌肤哲理用以在您访问我们平台时识别您的电脑或移动设备。
        <br>·第三方cookies，由我们平台的服务提供商提供，当您的电脑或移动设备访问其他网站时，服务提供商可用该等cookies进行识别。第三方cookies最常用于平台分析或广告目的。
        <br>Cookies可以在您的电脑或移动设备上保存不同的时间。某些cookies为“缓存cookies”，意味着只在您打开浏览器时存在，当您关闭浏览器时即予以删除。其他cookies是“永久cookies”，意味着即使在浏览器关闭时依然存在。在您打开浏览器或再次浏览因特网时，他们可用于识别您的电脑或移动设备。
        <p> philosophy肌肤哲理使用何种cookies？</p>
        <br>我们的平台只向您的电脑或移动设备提供以下类型cookies：
        <br>Cookie类型  目的
        <br>基本目的所需的cookies  这些cookies对于通过本平台向您提供服务和使用其某些特性，如访问安全区是必不可少的。没有这些cookies，您要求的某些服务，比如交易页面和安全登陆账号，将不能使用。
        <br>功能Cookies 这些cookies用于与本平台的展示、性能和功能有关的各种目的。但是他们的宗旨是增强访问者的平台体验和乐趣。
        <br>分析Cookies 这些cookies用以收集访问者如何使用我们平台的信息。
        <br>收集到的信息并非用来识别任何个别的访问者，而是进行汇总统计。该等信息包括我们平台的客流量、推荐访问我们平台的那些平台以及访问者在我们平台的访问页面。
        <br>前述信息用以帮助更有效的运行我们的平台、收集大范围的统计信息、并监测我们平台的活跃程度。
        <br>广告Cookies 当您访问我们的平台或点击平台上广告或促销区域的链接时，这些cookies被用来传递与您和您的喜好更相关的广告信息。该等cookies也用来限制您收看某一广告的次数以及帮助评估广告和促销的有效性。
        <br>这些cookies是经我们同意由广告网站放置的，记录了您访问了某一平台，并将该等信息分享给诸如广告主的其他机构。
        内容分享和社交网站Cookies  这些cookies使用户通过第三方社交网站和其他平台分享页面和内容。放置该等cookies的公司也可能使用您的信息在其他平台上发送定向广告。
        <br>如何管控或删除cookies
        <br>您有权选择是否接受cookies，我们已在下文向您解释了如何行使该等权利。但是，敬请注意如果您拒绝使用cookies，可能无法使用我们平台的所有功能
        <br>您可以通过改变您的浏览器设置来设定cookie喜好，从而使得来自本平台的cookie无法在您的电脑或移动设备上存放。请根据您所使用的浏览器的指令（通常位于“帮助”、“工具”或“编辑”栏中）进行上述设置。
        <br>IP地址
        <br>我们可能会收集关于您电脑或移动设备的信息，包括您可使用的IP地址、操作系统、登录次数和浏览器类型。此类信息用于我们更好地理解访问者是如何使用我们的平台的，以及用于内部报告。我们可能会将此类信息以匿名形式分享给广告商、赞助商或用于其他业务方面。
        <br>本网站会自动记录您在网站内的浏览，这些资料仅作为流量分析和网路行为调查，用于改善网站服务品质。仅对全体使用者行为总和进行分析，并不会对个别使用者进行个体分析。
        <p>分享您的信息</p>
        <br>为实现本隐私政策所描述的目的，我们可能将您的个人信息分享给科蒂商贸（上海）有限公司的关联公司。
        <p>除以下情形外，我们不会将您的个人信息出租、出售或分享给其他人或科蒂商贸（上海）有限公司的非关联公司：</p>
        <br>·该其他人或科蒂商贸（上海）有限公司的非关联公司是代表我们提供服务的第三方服务商，他们提供的服务包括在线或其他形式的付款、处理信用卡交易和处理信用核查及防止欺诈；除代表我们提供前述服务外，我们并不授权第三方服务商使用或披露您的个人信息。
        <br>·在我们认为披露您的个人信息是遵守法律或监管义务所需的，或是保护我们或任何第三方的权利的时候，我们可能会将您的个人信息披露给任何执法机构、法庭、监管机构、政府机构或其他第三方；及我们可能将您的个人信息披露给收购或受让所有或实质上所有我们的资产和业务的任何第三方。如发生该等出售或转让事宜，我们将尽合理努力尽量确保受让您个人信息的实体以与本隐私声明相一致的方式使用您的个人信息。
        <br>国际传递
        <br>我们收集的信息可能传递给一家或多家我们关联集团公司或第三方服务提供商所在的或拥有工厂的任何国家或区域，并在该国家或地区进行存储和处理。
        <p>儿童隐私</p>
        如果您未满18岁，您可以浏览我们的平台，但不能向我们提供您的个人信息。也就是说，您不能注册或购买产品。本平台不是为未满18岁人士设计，我们不会在明知的情况下收集任何未满18虽人士的个人信息。如我们得知我们不慎获得未满18岁访问者的个人信息，我们会从记录中将其删除。
        <br>保护您的信息
        <br>我们希望您对使用我们的平台充满信心，我们致力于保护我们收集的个人信息，保护您的个人信息是我们重要的经营理念。我们对访问您个人信息进行了限制，只允许合理需要接触您个人信息的员工为向您提供产品或服务之目的或为完成工作之目的而访问您的个人信息。我们拥有适当的技术和有组织的实物保护、电子防护和程序保障来保护您提供给我们的个人信息不被未经授权的或非法的处理，且不被意外丢失、损害或破坏。
        <br>同时，请您妥善保管自己的个人信息。如果您怀疑您的个人信息可能外泄，请立即联系我们，以免损害您的权益。
        <br>如何编辑、删除或访问您的个人信息
        <br>我们可能会不时更新本隐私声明。如进行更新，我们将在本平台上予以发布。如您不同意该等更改，请停止使用本平台。如对本隐私声明进行实质性更改，我们将通过电子邮件或在本平台上放置显著通知告知您。
        <p>联系我们</p>
        如您对本隐私声明或隐私事项有任何疑问或意见，请按以下地址与我们联系。如需获得我们所持有的您的个人资料的副本，您也可以通过以下地址与我们联系。
        <br>与您的个人资料有关的所有需求，请寄至：
        <br>philosophy肌肤哲理
        <br>中华人民共和国
        <br>上海市黄浦区福州路666号8楼C座
        <br>科蒂商贸（上海）有限公司
        <br>联系邮箱: cn_philosophy_ec@cotyinc.com
        <br>http:// www.philosophyskincare.com.cn 
      </div>
    </div>
  </div>
</template>

<!-- js -->
<script>
export default {
  name: 'modalBox',
  props: ['title', 'content', 'html'],
  data () {
    return {
      show: false,
      htmlText: ''
    }
  },
  methods: {
    cancelAction: function () {
      this.$emit('cancelAction')
    }
  }
}
</script>

<!-- css -->
<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped>
/* madal background */
h1 {
  font-size:1rem; 
  color: black;
}
.modalBox {
  position: fixed;
  top: 0;
  right: 0;
  bottom: 0;
  left: 0;
  z-index: 1000;
  background: rgba(0, 0, 0, 0.5);
  display: flex;
  flex-direction: column;
  align-items: center;
}
/* modal content */
.content {
  margin-top: 4rem;
  height: 75%;
  width: 88%;
  /*position: fixed;*/
  z-index: 1001;
  -webkit-overflow-scrolling: touch;
  outline: 0;
  overflow: scroll;
  margin: 30/@rate auto;
  background-color: white;
  display: flex;
  flex-direction: column;
  align-items: center;
  /*border-radius: 1rem;*/
}
.cancel_view {
  top: 4rem;
  position: absolute;
  height: 2rem;
  width: 100%;
  float: right;
  display: flex;
  flex-direction: row;
  align-items: center;
  z-index: 1002;
  /*background-color: red;*/
}
.cancel_img {
  position: absolute;
  left: 84%;
  top: 0.5rem;
  height: 1.2rem;
  width: 1.2rem;
}
.logo_img {
  height: 3.35rem;
  width: 11.2rem;
}
.title_line {
  margin-top: 0.8rem;
  height: 0.05rem;
  width: 8rem;
  background-color: black;
}
.title {
  margin-top: 0.8rem;
  font-size: 1.3rem;
  color: black;
  /*background-color: black;*/
}
.html_view {
  /*background-color: red;*/
  font-size: 1rem;
  width: 92%;
  height: 30rem;
  display: flex;
  flex-direction: column;
  align-items: left;
  font-size: 0.9rem;
  color: gray;
  text-align:left;
  margin-bottom: 2rem;
  /*overflow-y: hidden;*/
}

</style>
